const nouns = [
    "Пуська", "гений", "татарин", "аноним", "иллюминат", "котик", "СТУДЕНТ", "перфоратор", "супергерой", "панда", 
    "космонавт", "медведь", "доллар", "пирожок", "смешарик", "петух", "крокодил", "фея", "робот", 
    "пиротехник", "дедушка", "попугай", "снеговик", "песец", "котенок", "заяц", "пингвин", "футболист", 
    "дизайнер", "фотограф", "путешественник", "гриб", "шалфей", "торчок", "нарик", "петербуржец", "легенда", "сигма", "сёмга", "спамер", "казах",
    "патриот", "инопланетянин", "козёл", "художник", "поэт", "музыкант", "бард", "мудрец", "растягай",
    "клоун", "солнышко", "трипофоб", "клава", "Пит", "Дэб", "бобёр", "бобр", "", "будильник"
    
];

const adjectives = [
    "красивый",
    "умный",
    "смешной",
    "большой",
    "маленький",
    "яркий",
    "тихий",
    "шумный",
    "долгий",
    "короткий",
    "медленный", "гениальный", "надоедливый", "гнусный", "неопознанный", "счастливый", "радиоактивный", "реактивный", "наэлектризованный", "чёрный", "белый",
    "шумоподавляющий", "спамящий", "выбешивающий", "ярый", "недопонятый",
    "трипующий", "поющий", "орущий", "офигевающий", "Брэдд", "Джон", "Сыр", "Сэр", "Мисс", "Миссис", 
    "ЭТО ЖЕ", "задумавшийся", "мемный", "курва", "австрийский"
];

function getRandomPhrase() {
    const randomNoun = nouns[Math.floor(Math.random() * nouns.length)];
    const randomAdjective = adjectives[Math.floor(Math.random() * adjectives.length)];
    return `${randomAdjective.charAt(0).toUpperCase() + randomAdjective.slice(1)} ${randomNoun.charAt(0).toUpperCase() + randomNoun.slice(1)}`;
}
